The slope of this railing will not parallel the ramp at landings. To get a parallel railing, split the railing sketch at the ends of landings.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RailingCurvesNotSplitRamp { get; }
  Visual Basic
Public Shared ReadOnly Property RailingCurvesNotSplitRamp As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RailingCurvesNotSplitRamp {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace